app/controllers/scrapper_controller.rb

    def scrap
    page_url = params[:site_url]
    doc = Nokogiri::HTML(open(page_url))
    Store.save_data page_url
---
INSERT INTO `stores` (`created_at`, `updated_at`, `url`) VALUES ('2014-10-18 16:53:40', '2014-10-18 16:53:40', 'http://cybosol.com')
UPDATE `stores` SET `count` = 2, `updated_at` = '2014-10-18 16:58:51' WHERE `stores`.`id` = 1